import { Component, OnInit } from '@angular/core';
import { Garage } from '../../models/garage';
import { CustomMultiSelectComponent } from '../../component/core/custom-multi-select/custom-multi-select.component';

@Component({
  selector: 'app-multi-select',
  standalone: true,
  imports: [CustomMultiSelectComponent],
  templateUrl: './multi-select.component.html',
  styleUrls: ['./multi-select.component.css']
})
export class MultiSelectComponent implements OnInit {

  garages: Garage[] = [];
  garageNames: string[] = [];  // מערך שיכיל את השמות

  ngOnInit() {
    // אתחול המוסכים
    this.garages = [
      new Garage(1, 1001, 'נירים מוסך', 6, 'מוסך מורשה', 'ד.נ. הנגב', 'נירים', '054-7916219', 85125, 20, 'מכונאות רכב דיזל', 'אליהו ציון', 570005926, ''),
      new Garage(2, 1002, 'מוסך עידן', 5, 'מוסך פרטי', 'רחוב הדקל 3', 'תל אביב', '052-3456789', 12345, 21, 'מכונאות רכב', 'יוסי כהן', 570005927, '2024-11-01'),
      new Garage(3, 1003, 'מוסך גולן', 4, 'מוסך מורשה', 'רחוב הספורט 5', 'חיפה', '054-2345678', 54321, 22, 'מכונאות רכב', 'משה לוי', 570005928, '2024-10-15'),
      new Garage(4, 1004, 'מוסך גל', 7, 'מוסך מורשה', 'החווה 12', 'ירושלים', '050-1234567', 78945, 20, 'מכונאות רכב דיזל', 'ישראל לוי', 570005929, '2024-09-20'),
      new Garage(5, 1005, 'מוסך אור', 3, 'מוסך פרטי', 'רחוב הגפן 9', 'ראשון לציון', '053-5678910', 45678, 19, 'מכונאות רכב', 'איתן שטרית', 570005930, '2024-08-10'),
      new Garage(6, 1006, 'מוסך תומר', 2, 'מוסך מורשה', 'המרכז 8', 'באר שבע', '054-6789012', 11223, 18, 'מכונאות רכב דיזל', 'תומר ציון', 570005931, '2024-07-25'),
      new Garage(7, 1007, 'מוסך דוד', 6, 'מוסך מורשה', 'הפנינה 11', 'חולון', '056-7890123', 33445, 21, 'מכונאות רכב', 'דוד רוזנפלד', 570005932, '2024-06-15'),
      new Garage(8, 1008, 'מוסך שגיא', 4, 'מוסך פרטי', 'רחוב האורן 14', 'אשדוד', '057-8901234', 66778, 20, 'מכונאות רכב דיזל', 'שגיא מורנו', 570005933, '2024-05-30'),
      new Garage(9, 1009, 'מוסך יוסי', 5, 'מוסך מורשה', 'המרץ 6', 'נתניה', '055-4321098', 12367, 22, 'מכונאות רכב', 'יוסי סעדיה', 570005934, '2024-04-20'),
      new Garage(10, 1010, 'מוסך יעל', 1, 'מוסך מורשה', 'הצורף 7', 'פתח תקווה', '058-2345670', 98765, 19, 'מכונאות רכב דיזל', 'יעל אדרי', 570005935, '2024-03-10')
    ];

    this.garageNames = this.garages.map(garage => garage.garageName);
  }

  toggleCheckboxFn(item: string, checked: boolean) {
    console.log(item, checked);
  }
}
